"""
Напишите программу, которая считает площадь прямоугольника, спрашивая у пользователя длину двух сторон
"""
a = float(input('Enter side a: '))
b = float(input('Enter side b: '))

print('Area of a rectangle is:', a * b)