# Создать словарь из 5 пар: int -> str, например {6: '6'}, вывести его в консоль попарно

my_dict = {1: 'a', 2: 'b', 3: 'c', 'yy': 'd'}
print(my_dict['yy'])

for key, value in my_dict.items():
    print(key, value)




