# Создать tuple из 10 любых дробных чисел, найти максимальное и минимальное значение в нем

new_tuple = (14.1, 19.3, 5.2, 1.2, 9.1, 9.2, 13.8)
print(max(new_tuple))
print(min(new_tuple))
print(new_tuple[5])








