# сумма
print(7 + 3)

# разница
print(7 - 3)

# произведение
print(7 * 3)

# частное
print(7 / 3)

# операция целочисленного деления
# return 2
print(7 // 3)

# остаток от деления
# return 1
print(7 % 3)

# число, противоположное 7
print(-7)

# модуль числа -7
print(abs(-7))

# преобразовать 7 в целое число
print(int(7))

# преобразовать 7 в число с плавующей точкой
print(float(7))

# создать комплексное число 7 + 3*i
print(complex(7, 3))

# 7 в степени 3
print(7 ** 3)
print(pow(7, 3))

# округлить действительное число 7.53654 (до n цифр после запятой, если n указано)
# return 8
print(round(7.53654))
# return 7.237
print(round(7.33654, 3))
